table_element_rel = [
  [1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2],
  [3, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 6, 7, 8, 9, 10],
  [11, 12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 13, 14, 15, 16, 17, 18],
  [19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36],
  [37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54],
  [55, 56, 0, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86],
  [87, 88, 0, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118],
  [0, 0, 0, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71],
  [0, 0, 0, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103]
]

element_names = {
  1: ['H', 'Водород'],
2: ['He', 'Гелий'],
3: ['Li', 'Литий'],
4: ['Be', 'Бериллий'],
5: ['B', 'Бор'],
6: ['C', 'Углерод'],
7: ['N', 'Азот'],
8: ['O', 'Кислород'],
9: ['F', 'Фтор'],
10: ['Ne', 'Неон'],
11: ['Na', 'Натрий'],
12: ['Mg', 'Магний'],
13: ['Al', 'Алюминий'],
14: ['Si', 'Кремний'],
15: ['P', 'Фосфор'],
16: ['S', 'Сера'],
17: ['Cl', 'Хлор'],
18: ['Ar', 'Аргон'],
19: ['K', 'Калий'],
20: ['Ca', 'Кальций'],
21: ['Sc', 'Скандий'],
22: ['Ti', 'Титан'],
23: ['V', 'Ванадий'],
24: ['Cr', 'Хром'],
25: ['Mn', 'Марганец'],
26: ['Fe', 'Железо'],
27: ['Co', 'Кобальт'],
28: ['Ni', 'Никель'],
29: ['Cu', 'Медь'],
30: ['Zn', 'Цинк'],
31: ['Ga', 'Галлий'],
32: ['Ge', 'Германий'],
33: ['As', 'Мышьяк'],
34: ['Se', 'Селен'],
35: ['Br', 'Бром'],
36: ['Kr', 'Криптон'],
37: ['Rb', 'Рубидий'],
38: ['Sr', 'Стронций'],
39: ['Y', 'Иттрий'],
40: ['Zr', 'Цирконий'],
41: ['Nb', 'Ниобий'],
42: ['Mo', 'Молибден'],
43: ['Tc', 'Технеций'],
44: ['Ru', 'Рутений'],
45: ['Rh', 'Родий'],
46: ['Pd', 'Палладий'],
47: ['Ag', 'Серебро'],
48: ['Cd', 'Кадмий'],
49: ['In', 'Индий'],
50: ['Sn', 'Олово'],
51: ['Sb', 'Сурьма'],
52: ['Te', 'Теллур'],
53: ['I', 'Иод'],
54: ['Xe', 'Ксенон'],
55: ['Cs', 'Цезий'],
56: ['Ba', 'Барий'],
57: ['La', 'Лантан'],
58: ['Ce', 'Церий'],
59: ['Pr', 'Празеодим'],
60: ['Nd', 'Неодим'],
61: ['Pm', 'Прометий'],
62: ['Sm', 'Самарий'],
63: ['Eu', 'Европий'],
64: ['Gd', 'Гадолиний'],
65: ['Tb', 'Тербий'],
66: ['Dy', 'Диспрозий'],
67: ['Ho', 'Гольмий'],
68: ['Er', 'Эрбий'],
69: ['Tm', 'Тулий'],
70: ['Yb', 'Иттербий'],
71: ['Lu', 'Лютеций'],
72: ['Hf', 'Гафний'],
73: ['Ta', 'Тантал'],
74: ['W', 'Вольфрам'],
75: ['Re', 'Рений'],
76: ['Os', 'Осмий'],
77: ['Ir', 'Иридий'],
78: ['Pt', 'Платина'],
79: ['Au', 'Золото'],
80: ['Hg', 'Ртуть'],
81: ['Tl', 'Таллий'],
82: ['Pb', 'Свинец'],
83: ['Bi', 'Висмут'],
84: ['Po', 'Полоний'],
85: ['At', 'Астат'],
86: ['Rn', 'Радон'],
87: ['Fr', 'Франций'],
88: ['Ra', 'Радий'],
89: ['Ac', 'Актиний'],
90: ['Th', 'Торий'],
91: ['Pa', 'Протактиний'],
92: ['U', 'Уран'],
93: ['Np', 'Нептуний'],
94: ['Pu', 'Плутоний'],
95: ['Am', 'Америций'],
96: ['Cm', 'Кюрий'],
97: ['Bk', 'Берклий'],
98: ['Cf', 'Калифорний'],
99: ['Es', 'Эйнштейний'],
100: ['Fm', 'Фермий'],
101: ['Md', 'Менделевий'],
102: ['No', 'Нобелий'],
103: ['Lr', 'Лоуренсий'],
104: ['Rf', 'Резерфордий'],
105: ['Db', 'Дубний'],
106: ['Sg', 'Сиборгий'],
107: ['Bh', 'Борий'],
108: ['Hs', 'Хассий'],
109: ['Mt', 'Мейтнерий'],
110: ['Ds', 'Дармштадтий'],
111: ['Rg', 'Рентгений'],
112: ['Cn', 'Коперниций'],
113: ['Nh', 'Нихоний'],
114: ['Fl', 'Флеровий'],
115: ['Mc', 'Московий'],
116: ['Lv', 'Ливерморий'],
117: ['Ts', 'Теннессин'],
118: ['Og', 'Оганессон'],
}

function f(id) {
  alert(id)
}

for (var i = 0; i < 9; ++i) {
  if (i < 7) ind = 1;
  else ind = 2;

  document.getElementById('table' + ind).innerHTML += `
  <div class='table-row' id='table-row-${i}'></div>
  `
  for (var j = 0; j < 18; ++j) {
    if (table_element_rel[i][j] == 0) visibility = '-empty'
    else visibility = ''

    if (table_element_rel[i][j] != 0) intext = element_names[table_element_rel[i][j]][0];
    else intext = 'hui'
    document.getElementById(`table-row-${i}`).innerHTML += `
    <div class='table-element${visibility}'  style="user-select: none;" onclick=f("${intext}_${table_element_rel[i][j].toString()}")>
      ${intext}
    </div>
    `
  }

}
